{"timestamp": "2026-01-10T17:15:42.284293", "text": "hello from codex", "post_id": "urn:li:share:7415879034229972992", "status": "published"}
{"text": "As a second-year Computer Science student at the University of Guelph, my journey into the world of AI automation has been both challenging and rewarding. Over the past year, I have immersed myself in", "platform": "linkedin", "timestamp": "2026-01-11T02:12:29.300707+00:00", "status": "posted", "post_id": "urn:li:share:7415938620307783680"}
{"text": "🚀 Exciting News in the World of Social Media! 🚀\n\nI’m thrilled to share that our latest AI features on LinkedIn, X (formerly Twitter), and Facebook are set to revolutionize how we engage, network, and ", "platform": "linkedin", "timestamp": "2026-01-14T00:41:49.993594+00:00", "status": "posted", "post_id": "urn:li:share:7417002970824908800"}
{"text": "🚀 Exciting times ahead as we embrace the transformative power of AI across major platforms like LinkedIn, X (formerly Twitter), and Facebook! Our new AI features are designed not only to enhance user ", "platform": "linkedin", "timestamp": "2026-01-14T00:49:13.442379+00:00", "status": "posted", "post_id": "urn:li:share:7417004829694173185"}
{"text": "In the rapidly evolving landscape of artificial intelligence, the concept of agentic AI is emerging as a pivotal force in transforming how businesses operate. Unlike traditional AI systems that merely", "platform": "linkedin", "timestamp": "2026-01-14T02:28:06.435870+00:00", "status": "posted", "post_id": "urn:li:share:7417029714713821184"}
{"text": "🚀 The Rise of Agentic AI: Transforming Business Landscapes 🚀\n\nAs we navigate through the dynamic terrain of technology, Agentic AI has emerged as a game changer, reshaping how businesses operate and m", "platform": "linkedin", "timestamp": "2026-01-14T02:41:34.701486+00:00", "status": "posted", "post_id": "urn:li:share:7417033104852373504"}
{"text": "In today's rapidly evolving technological landscape, Agentic AI stands out as a beacon of innovation and potential. This emerging class of artificial intelligence is not just about automation; it empo", "platform": "linkedin", "timestamp": "2026-01-14T02:55:42.477335+00:00", "status": "posted", "post_id": "urn:li:share:7417036661085245440"}
{"text": "In the rapidly evolving landscape of artificial intelligence, the concept of agentic AI is gaining significant traction. But what exactly does \"agentic\" mean in this context? Simply put, agentic AI re", "platform": "linkedin", "timestamp": "2026-01-14T16:32:57.496472+00:00", "status": "posted", "post_id": "urn:li:share:7417242329192894464"}
